books = {
    "Властелин колец": {
        "автор": "Дж. Р. Р. Толкин",
        "год издания": 1954,
        "жанр": "фэнтези",
        "количество страниц": 1178
    },
    "Гарри Поттер и философский камень": {
        "автор": "Джоан Роулинг",
        "год издания": 1997,
        "жанр": "фэнтези",
        "количество страниц": 309
    },
    "1984": {
        "автор": "Джордж Оруэлл",
        "год издания": 1949,
        "жанр": "дистопия",
        "количество страниц": 328
    }
}

print("Інформацію по якій книзі плануєте переглянути?")
book_name = input()

for book, info in books.items():
    if book_name == book:
        avtor = info["автор"]
        year = info["год издания"]
        ganre = info["жанр"]
        pages = info["количество страниц"]

        print(f"Автор книги: {avtor}")
        print(f"Год: {year}")
        print(f"Жанр: {ganre}")
        print(f"Количество страниц: {pages}")